In [1]:
pwd

'C:\\Users\\admin\\Desktop\\Personal stuff\\Datascience- Pandas with python\\Proj1-Housing'

In [2]:
#importing the libraries and modules
import pandas as pd
import numpy as np

In [9]:
#importing the dataset in csv format
df1 = pd.read_csv ("Housing-in-Mexico.csv")
df2 = pd.read_csv ("Housing-in-Mexico - 2.csv")
df3 = pd.read_csv ("Housing-in-Mexico - 3.csv")

## Data Cleaning

In [10]:
#Checking for the shape of the dataset i.e the number of observations and features
df1.shape
df2.shape
df3.shape

(1000, 5)

In [11]:
#Checking for the datatypes of the dataset
df1.info()
df2.info()
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  1000 non-null   object
 1   state          1000 non-null   object
 2   lat            959 non-null    float64
 3   lon            946 non-null    float64
 4   area_m2        1000 non-null   float64
 5   price_usd      1000 non-null   object
dtypes: float64(3), object(3)
memory usage: 47.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  1000 non-null   object
 1   state          1000 non-null   object
 2   lat            938 non-null    float64
 3   lon            943 non-null    float64
 4   area_m2        1000 non-null   float64
 5   price_mxn      1000 non-null   float64
dtypes: float64(4), object(2)
memory usage: 47.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   property_type            1000 non-null   object
 1   place_with_parent_names  1000 non-null   object
 2   lat-lon                  958 non-null    object
 3   area_m2                  1000 non-null   float64
 4   price_usd                1000 non-null   float64
dtypes: float64(2), object(3)
memory usage: 39.2+ KB

In [12]:
#Checking for the first 5 rows
df1.head()
df2.head()
df3.head()

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd
0,house,"México,Estado de México,Toluca,Metepec","19.524143,-",7.6,443846.95
1,apartment,"México,Quintana Roo,Benito Juárez,Cancún","19.2640539,-99.5727534",17.6,375256.46
2,house,"México,Tamaulipas,Tampico","20.689157,-103.366728",472.1,191453.00
3,house,"México,Tamaulipas,Tampico","19.52589,-99.151703",174.1,124315.34
4,house,"México,Distrito Federal,Gustavo A. Madero,Acue...","19.52589,-99.151703",129.9,445350.50

In [17]:
#Checking for the values in a particular column-shows frist and last 5
df1['price_usd']

0      $340,632.31
1      $307,074.03
2      $347,139.86
3       $91,926.78
4      $149,990.26
           ...
995    $184,430.96
996    $156,603.37
997     $34,963.57
998    $256,504.12
999    $351,769.20
Name: price_usd, Length: 1000, dtype: object

In [24]:
#Checking for the values between observations (50-60) in price.
df1.price_usd[0:10]

0    340632.31
1    307074.03
2    347139.86
3     91926.78
4    149990.26
5    379871.37
6    127968.23
7    177188.20
8    336504.28
9    328690.03
Name: price_usd, dtype: float64

In [25]:
# Ensure 'price' column is of string data type
df1['price_usd'] = df1['price_usd'].astype(str)

"""To drop a column that is not needed or in use then use the method
df.drop(columns=["price"] inplace=True)"""

#To remove '$' and ',' from the price column and change the datatype to floating-point(float) for manipulation of data with pandas.
df1["price_usd"]= (
    df1["price_usd"]
    .str.replace("$" , "", regex=False)
    .str.replace("," , "")
    .astype(float)
)
df1.info()
df1.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  1000 non-null   object
 1   state          1000 non-null   object
 2   lat            959 non-null    float64
 3   lon            946 non-null    float64
 4   area_m2        1000 non-null   float64
 5   price_usd      1000 non-null   float64
dtypes: float64(4), object(2)
memory usage: 47.0+ KB

  property_type     state        lat         lon  area_m2  price_usd
0         house    Pahang   3.967144  103.403910    117.8  340632.31
1         house  Rogaland  58.848193    5.664660    362.2  307074.03
2         house   Jalisco  19.405296  -99.150458    323.5  347139.86
3         house  Rogaland        NaN    5.712328    236.4   91926.78
4     apartment   Sarawak   3.191408  113.088634    204.8  149990.26

In [28]:
# Ensure 'price' column is of string data type
#df2['price_mxn'] = df2['price_mxn'].astype(str)

#Convert pesos to usd
df2["price_usd"] = df2["price_mxn"] / 19
 
"""To drop a column that is not needed or in use then use the method"""
df2.drop(columns= ["price_mxn"], inplace=True)
df2.head()

,property_type,state,lat,lon,area_m2,price_usd
0,house,Oklahoma,-21.696099,21.648186,377.5,226412.963158
1,house,Haute-Normandie,58.398616,15.538514,191.4,35796.715789
2,house,Rhône-Alpes,27.664401,85.318791,279.6,252015.105263
3,house,Haute-Normandie,26.497669,104.980581,258.3,215633.073684
4,apartment,Oslo,1.558938,110.346648,207.6,96312.831579

In [29]:
# Ensure 'price' column is of string data type
df3['price_usd'] = df3['price_usd'].astype(str)
df3.head()

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd
0,house,"México,Estado de México,Toluca,Metepec","19.524143,-",7.6,443846.95
1,apartment,"México,Quintana Roo,Benito Juárez,Cancún","19.2640539,-99.5727534",17.6,375256.46
2,house,"México,Tamaulipas,Tampico","20.689157,-103.366728",472.1,191453.0
3,house,"México,Tamaulipas,Tampico","19.52589,-99.151703",174.1,124315.34
4,house,"México,Distrito Federal,Gustavo A. Madero,Acue...","19.52589,-99.151703",129.9,445350.5

In [30]:
#Drop null values from dataframe 3
df3.dropna(inplace=True)

#Create "lat" and "lon" columns for df3
df3[["lat", "lon"]] = df3["lat-lon"].str.split(",", expand=True)

df3.head()

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd,lat,lon
0,house,"México,Estado de México,Toluca,Metepec","19.524143,-",7.6,443846.95,19.524143,-
1,apartment,"México,Quintana Roo,Benito Juárez,Cancún","19.2640539,-99.5727534",17.6,375256.46,19.2640539,-99.5727534
2,house,"México,Tamaulipas,Tampico","20.689157,-103.366728",472.1,191453.0,20.689157,-103.366728
3,house,"México,Tamaulipas,Tampico","19.52589,-99.151703",174.1,124315.34,19.52589,-99.151703
4,house,"México,Distrito Federal,Gustavo A. Madero,Acue...","19.52589,-99.151703",129.9,445350.5,19.52589,-99.151703

In [31]:
#Create "state" column for df3
df3["state"] = df3["place_with_parent_names"].str.split("|", expand =True)

#Drop the column "place_with_parent_names" and "lat-lon" from df3
df3.drop(columns=["place_with_parent_names" , "lat-lon"], inplace=True)

df3.head()

,property_type,area_m2,price_usd,lat,lon,state
0,house,7.6,443846.95,19.524143,-,"México,Estado de México,Toluca,Metepec"
1,apartment,17.6,375256.46,19.2640539,-99.5727534,"México,Quintana Roo,Benito Juárez,Cancún"
2,house,472.1,191453.0,20.689157,-103.366728,"México,Tamaulipas,Tampico"
3,house,174.1,124315.34,19.52589,-99.151703,"México,Tamaulipas,Tampico"
4,house,129.9,445350.5,19.52589,-99.151703,"México,Distrito Federal,Gustavo A. Madero,Acue..."

In [32]:
#Concatenation of the 3 cleaned datasets
final_df = pd.concat([df1, df2, df3])
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2958 entries, 0 to 999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  2958 non-null   object
 1   state          2958 non-null   object
 2   lat            2855 non-null   object
 3   lon            2847 non-null   object
 4   area_m2        2958 non-null   float64
 5   price_usd      2958 non-null   object
dtypes: float64(1), object(5)
memory usage: 161.8+ KB

In [34]:
#Saving the final dataframe to a CSV file
final_df.to_csv("C:\\Users\\admin\Desktop\\Personal stuff\\Datascience- Pandas with python\Proj1-Housing.csv", index=False)